HarryVienna/ESP32-Weather-Station-and-Air-Quality-Monitor/Sensor-ESP-NOW-BME280/sdkconfig.defaults
# Target chip
CONFIG_IDF_TARGET="esp32"

# No reboot after panic
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y

# ESP32-specific: 80 MHz sufficient for I2C/SPI/ADC — saves ~40 mA vs 240 MHz
CONFIG_ESP32_TIME_SYSCALL_USE_RTC_FRC1=y
CONFIG_ESP32_RTC_CLK_SRC_INT_RC=y
CONFIG_ESP32_DEFAULT_CPU_FREQ_80=y
CONFIG_ESP32_DEFAULT_CPU_FREQ_MHZ=80

# Logging: INFO for development — set to NONE for production
CONFIG_LOG_DEFAULT_LEVEL=3
#CONFIG_LOG_DEFAULT_LEVEL_NONE=y
#CONFIG_BOOTLOADER_LOG_LEVEL_NONE=y

CONFIG_ESP_TASK_WDT=n

CONFIG_ESPTOOLPY_FLASHSIZE_DETECT=n
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# Skip firmware SHA256 validation on deep-sleep wake — saves ~200 ms at ~100 mA
CONFIG_BOOTLOADER_SKIP_VALIDATE_IN_DEEP_SLEEP=y

# Disable old I2C driver to avoid conflict with new I2C driver
CONFIG_IDF_DRIVER_I2C_MASTER_NG=y
CONFIG_IDF_DRIVER_I2C_MASTER_OLD=n
